# SQL이란?

1. DML(Data Manipulation language)

2. DDL(Data Definition language)

3. DCL(Data Control language)

# 실행언어 모음

- block을 씌우면 부분 실행 가능
- **;**: SQL query가 끝났다는 표시
- * : 모든 것(all)을 표현할 때 사용
- **SHOW databases** : MySQL서버에 Database가 뭐가 있는지 보여달라는 명령
- **USE 'database name'** : 사용할 데이터베이스 지정. 해당 database를 사용하게끔 하는 명령. 더블클릭으로도 가능 (두꺼운 글씨로 바뀌면 성공한 것)
- **SHOW table** : 데이터베이스의 테이블 이름 보기
- **SHOW table STATUS** : 데이터베이스의 테이블 정보 조회
- **DESCRIBE 'table name'** : 데이터 table에 무슨 열이 있는지 조회  
  **DESC** : 여기까지만 써도 됨

## Select
- **SELECT** : 데이터를 가져오는 구문. 데이터베이스 내 테이블에서 원하는 정보를 추출
  > `select의 구문 형식`  
   SELECT select_expr
    - [FROM table_references]    # column을 보고 싶을 때
    - [WHERE where_condition]   # row를 보고 싶을 때
    - [GROUP BY {col_name | expr | position}]
    - [HAVING where_condition]
    - [ORDER BY {col_name | expr | position}]
- **SELECT 'col_names' FROM 'table_name'** : table에서 원하는 col만 불러오기
- **SELECT 'col_names' FROM 'table_name'** where '조건' : table에서 원하는 col 중에서 원하는 row를 뽑기  
  **여기에** AND, OR 등의 관계 연산자들 사용가능!
- **SELECT * FROM 'table_name' WHERE 'column name' BETWEEN 'condition1' AND 'condition2** : between 문을 쓰는 방법

- **IN** : 이산적인 값의 조건에서 사용가능
- **BETWEEN**: 조건을 걸어줄 때 편리
- **WHERE**: 원하는 조건에 따라 데이터 선택 가능
- **LIKE**: 문자열의 내용 검색. 
  - 문자 뒤에 %: 무엇이든 허용
  - _: 한 글자만 매치하기 위함
- SUB QUERY: 쿼리문 안에 또 쿼리문이 들어 있는 것
  - ANY: sub query의 결과 중에 한 가지만 만족해도 가능
  - ALL: sub query의 결과를 모두 만족시켜야 함
- ORDER BY: 결과가 출력되는 순서를 조절하는 구문. Ascending이 default
- DISTINCT: 중복된 것을 1개씩만 보여주면서 출력, 테이블의 크기가 클수록 효율적
- LIMIT: 출력 개수를 제한. 상위의 N개만 출력하는 'limit n' 구문
- GROUP BY
: 그룹을 묶어주는 역할
  - avg( ): 평균
  - min( ): 최소값
  - max( ): 최대값
  - count( ): 행의 개수
  - count( distinct ): 중복 제외된 행의 개수
  - stdev( ): 표준 편차
  - variance( ): 분산
  - as 'column name': as를 붙이면 뒤에 원하는 column 이름이 옴
- HAVING: WHERE과 비슷한 개념으로 조건 제한. 반드시 group by절 다음에 나와야 함
- ROLLUP: 총합 또는 중간합계가 필요할 경우에 사용. GROUPY BY절과 함께 WITH ROLLUP문 사용
- JOIN: 데이터베이스 내의 여러 테이블에서 가져온 레코드를 조합하여 하나의 테이블이나 결과 집합으로 표현

> MySQL 내장 함수
- LENGTH( ): 전달받은 문자열의 길이를 반환
- CONCAT( ): 전달받은 문자열을 모두 결합하여 하나의 문자열로 반환
- LOCATE( ): 문자열 내에서 찾는 문자열이 처음으로 나타나는 위치를 찾아서 해당 위치를 반환. 찾는 문자열이 존재하지 않으면 0을 반환. MySQL은 문자열의 시작 index를 1부터 계산
- LEFT( ): 문자열의 왼쪽부터 지정한 개수만큼의 문자를 반환
- RIGHT( ): 문자열의 오른쪽부터 지정한 개수만큼의 문자를 반환
- LOWER( ): 문자열을 모두 소문자로 변경
- UPPER( ): 문자열을 모두 대문자로 변경
- REPLACE( ): 문자열에서 특정 문자열을 대체 문자열로 교체
- TRIM( ): 문자열의 앞 or 뒤 or 양쪽 모두에 있는 특정 문자를 제거  
  > 사용가능한 지정자
  - BOTH: 전달받은 문자열의 양 끝에 존재하는 특정 문자를 제거(Default)
  - LEADING: 전달받은 문자열 앞에 존재하는 특정 문자를 제거
  - TRAILING: 전달받은 문자열 뒤에 존재하는 특정 문자를 제거
- FORMAT( ): 숫자 타입의 데이터를 세 자리마다 쉼표를 사용하는 형식으로 변한. 반환되는 데이터는 str, 두 번째 인수는 반올림할 소수 부분의 자릿수
- FLOOR( ): 내림
- CEIL( ): 올림
- ROUND( ): 반올림
- SQRT( ): 양의 제곱근
- POW( ): 첫 번째 인수로는 밑수, 두 번째 인수로는 지수를 전달하여 거듭제곱 계산
- EXP( ): 인수로 지수를 전달받아, e의 거듭제곱을 계산
- LOG( ): 자연로그 값을 계산
- SIN( ): 사인값 반환
- COS( ): 코사인값 반환
- TAN( ): 탄젠트값 반환
- ABS(X): 절대값을 반환
- RAND( ): 0.0보다 크거나 같고 1보다 작은 하나의 실수를 무작위로 생성
- NOW( ): 현재 날짜와 시간을 반환 
- CURDATE( ): 현재 날짜를 반환
- CURTIME( ): 현재 시간을 반환
- DATE( ): 전달받은 값에 해당하는 날짜 정보를 반환
- MONTH( ): 월에 해당하는 값을 반환
- DAY( ): 일에 해당하는 값을 반환
- HOUR( ): 시간에 해당하는 값을 반환
- MINUTE( ): 분에 해당하는 값을 반환
- SECOND( ): 초에 해당하는 값을 반환
- MONTHNAME( ): 월 이름을 반환
- DAYNAME( ): 요일 이름을 반환
- DAYOFWEEK( ): 해당 주에서 몇 번째 날인지를 반환
- DAYOFMONTH( ): 해당 월에서 몇 번째 날인지를 반환
- DAYOFYEAR( ): 해당 연도에서 몇 번째 날인지를 반환
- DATE_FORMAT( ): 전달받은 형식에 맞춰 날짜, 시간 정보를 문자열로 반환

> MySQL 고급  
- CREATE TABLE AS SELECT: 테이블 생성
- CREATE DATABASE: 새로운 DB를 생성
-

In [0]:
# CREATE DATABASE
CREATE DATABASE hyun;

USE hyun;

In [0]:
# CREATE TABLE AS SELECT
CREATE TABLE city2 AS SELECT * FROM city;

In [0]:
# DATE_FORMAT()
SELECT
DATE_FORMAT(NOW(), %D %y %a %d %m %n %j)

In [0]:
# DAYOFWEEK(), DAYOFMONTH(), DAYOFYEAR()
SELECT
NOW(),
DAYOFWEEK(NOW());

In [0]:
# MONTHNAME(), DAYNAME()
SELECT
NOW(),
MONTHNAME(NOW()),
DAYNAME(NOW())

In [0]:
# DATE(), MONTH(), DAY(), HOUR(), MINUTE(), SECOND()
SELECT
NOW(),
DATE(NOW()),
MONTH(NOW()),
DAY(NOW()),
HOUR(NOW()),
MINUTE(NOW()),
SECOND(NOW())

In [0]:
# ABS(), RAND()
SELECT ABS(-3), RAND(), ROUND(RAND()*100, 0);

In [0]:
# SQRT( ), POW(), EXP(), LOG()
SELECT SQRT(4), POW(2,3), EXP(3), LOG(3)

In [0]:
# FLORR(), CEIL(), ROUND()
SELECT FLOOR(10.95), CEIL(10.95), ROUND(10.95)

In [0]:
# format
SELECT FORMAT(123123123123.123123123, 3);

In [0]:
# TRIM()
SELECT TRIM('                     MySQL         ');
TRIM(LEADING '#' FROM '###MySQL###').
TRIM(TRAILING '#' FROM'###MySQL###');

In [0]:
# REPLACE()
SELECT REPLACE('MSSQL', 'MS', 'MY');

In [0]:
# LOWER(), UPPER()
SELECT
LOWER('mYSQL ISA CDLSLDKCM ALSCKMDLS CLSMDCKL KLC')
UPPER('mYSQL ISA CDLSLDKCM ALSCKMDLS CLSMDCKL KLC')

In [0]:
# LEFT(), RIGHT()
SELECT
LEFT('mYSQL ISA CDLSLDKCM ALSCKMDLS CLSMDCKL KLC', 5)
RIGHT('mYSQL ISA CDLSLDKCM ALSCKMDLS CLSMDCKL KLC', 6)

In [0]:
# LOCATE()
SELECT LOCATE('abc', 'abcdkcslkdfkladf')

In [0]:
# concat 예시
SELECT CONCAT('My', 'sql OP'，'ENG)

In [0]:
# LENGTH()
SELECT LENGTH('alskdjf)

In [0]:
# JOIN 예시
# citry, country, countrylanguage 테이블 3개를 join 하기
SELECT *
FROM city
JOIN country ON city.CountryCode = country.Code
JOIN countrylanguage ON city.CountryCode = countrylanguage.CountryCode

In [0]:
# JOIN
SELECT *
FROM city
JOIN country ON city.CountryCode = country.Code

In [0]:
# ROLLUP
SELECT CountryCode, Name SUM(Population)
FROM city
GROUP BY CountryCode, Name WITH ROLLUP

In [0]:
# having
SELECT CoutnryCode, MAX(Populiation)
FROM city
GROUP BY CountryCode
HAVING MAX(Population) > 8000000

In [0]:
# city에서 population의 평균 구하기
SELECT ag(Population)
FROM city

In [0]:
# groupby as
SELECT CountryCode, avg(Population) AS 'Average'
FROM city
GROUP BY CountryCode

In [0]:
# groupby
SELECT CountryCode, Max(Population)
FROM city
GROUP BY CountryCode

In [0]:
# Limit
# 상위 10개만 보기
SELECT *
FROM city
ORDER BY Population DESC
LIMIT 10

In [0]:
# distinct
SELECT DISTINCT CountryCode
FROM city;

In [0]:
# 국가 면적 크기로 내림차순하기
SELECT *
FROM country
ORDER BY SurfaceArea DESC;

In [0]:
# 한국에 있는 도시들 인구수로 내림차순하기
SELECT *
FROM city
WHERE CountryCode = 'KOR'
ORDER BY Population DESC

In [0]:
# order by
# decending order
SELECT *
FROM city
ORDER BY Population DESC

# ascending order
SELECT *
FROM city
ORDER BY Population 

# multiple order by
SELECT *
FROM city
ORDER BY CountryCode ASC, Population DESC

In [0]:
# Sub query ANY
SELECT *
FROM city
WHERE Population > ANY ( select Population
                        FROM city
                        WHERE District = 'New York')

In [0]:
# Sub query
SELECT *
FROM city
WHERE CountryCode = ( SELECT CountryCode
                     FROM city
                     WHERE Name = 'Seoul');

In [0]:
# select 예시
SELECT * FROM city;    # city의 전체 row를 보여줘라
SELECT Name FROM city;
SELECT Name, Population FROM city;

In [0]:
# select where 예시
SELECT *
FROM city
WHERE Population > 8000000

# 이렇게 해도 됨
SELECT * FROM city WEHRE Population > 8000000

In [0]:
# select, where, 관계연산자 예시
## 예시1
SELECT *
FROM city
WHERE Population < 8000000
AND Population > 70000000

## 예시2
SELECT *
FROM city
WHERE CountryCode = 'KOR'
AND Population >= 1000000

In [0]:
# select, in 예시
SELECT *
FROM city
WHERE name IN('Seoul', 'New York', 'Tokyo')

In [0]:
# select, like 예시
## 예시1
WHERE *
FROM city
WHERE CountryCode LIKE 'KO_'

## 예시2
SELECT *
FROM city
WHERE CountryCode LIKE 'Tel %'